In [103]:
import numpy as np
import pandas as pd
import mathplot as mt
import seaborn as sns
import matplotlib.pyplot as plt
from sklearn import datasets, linear_model

In [104]:
dt = pd.read_csv("C:\\Users\\ashwi\.jupyter\\Jupyter Notebook\\Assignment Titanic\\train.csv")

In [105]:
dt.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [106]:
dt.drop (['PassengerId', 'Pclass', 'Name', 'Ticket', 'Cabin', 'SibSp', 'Parch', 'Embarked'], axis=1, inplace=True )

In [107]:
dt.head()

   Survived     Sex   Age     Fare
0         0    male  22.0   7.2500
1         1  female  38.0  71.2833
2         1  female  26.0   7.9250
3         1  female  35.0  53.1000
4         0    male  35.0   8.0500

In [108]:
dt.isnull().sum()

Survived      0
Sex           0
Age         177
Fare          0
dtype: int64

In [109]:
dt.mean().sum()

62.2871639994718

In [110]:
dt['Age'].fillna(dt['Age'].mean(), inplace=True)

In [111]:
dt.head()

   Survived     Sex   Age     Fare
0         0    male  22.0   7.2500
1         1  female  38.0  71.2833
2         1  female  26.0   7.9250
3         1  female  35.0  53.1000
4         0    male  35.0   8.0500

In [112]:
dt.isnull().sum()

Survived    0
Sex         0
Age         0
Fare        0
dtype: int64

In [113]:
dt.head().count()

Survived    5
Sex         5
Age         5
Fare        5
dtype: int64

In [114]:
sex_dummies=pd.get_dummies(dt['Sex'],drop_first=True)

In [133]:
dt=pd.concat([dt,sex_dummies],axis=1)

In [134]:
dt.head()

   Survived       Age      Fare  male  male
0         0 -0.592481 -0.502445     1     1
1         1  0.638789  0.786845     0     0
2         1 -0.284663 -0.488854     0     0
3         1  0.407926  0.420730     0     0
4         0  0.407926 -0.486337     1     1

In [135]:
dt.drop (['Sex'], axis=1, inplace=True )

KeyError: "['Sex'] not found in axis"

In [136]:
dt.head()

   Survived       Age      Fare  male  male
0         0 -0.592481 -0.502445     1     1
1         1  0.638789  0.786845     0     0
2         1 -0.284663 -0.488854     0     0
3         1  0.407926  0.420730     0     0
4         0  0.407926 -0.486337     1     1

In [137]:
from sklearn.preprocessing import StandardScaler
ss = StandardScaler()

In [138]:
feature_scale= ['Age', 'Fare']
dt[feature_scale]=ss.fit_transform(dt[feature_scale])

In [139]:
dt.head()

   Survived       Age      Fare  male  male
0         0 -0.592481 -0.502445     1     1
1         1  0.638789  0.786845     0     0
2         1 -0.284663 -0.488854     0     0
3         1  0.407926  0.420730     0     0
4         0  0.407926 -0.486337     1     1

In [140]:
x=dt.drop(['Survived'], axis=1)
y=dt['Survived']

In [141]:
from sklearn.model_selection import GridSearchCV
from sklearn.tree import DecisionTreeClassifier
from sklearn.neighbors import KNeighborsClassifier
from sklearn.svm import SVC

In [142]:
# create parameter
model_param = {
    'DecisionTreeClassifier':{
        'model':DecisionTreeClassifier(),
        'param':{
            'criterion': ['gini','entropy']
        }
    },
        'KNeighborsClassifier':{
        'model':KNeighborsClassifier(),
        'param':{
            'n_neighbors': [5,10,15,20,25]
        }
    },
        'SVC':{
        'model':SVC(),
        'param':{
            'kernel':['rbf','linear','sigmoid'],
            'C': [0.1, 1, 10, 100]
         
        }
    }
}

In [143]:
scores =[]
for model_name, mp in model_param.items():
    model_selection = GridSearchCV(estimator=mp['model'],param_grid=mp['param'],cv=5,return_train_score=False)
    model_selection.fit(x,y)
    scores.append({
        'model': model_name,
        'best_score': model_selection.best_score_,
        'best_params': model_selection.best_params_
    })

In [144]:
data_model_score = pd.DataFrame(scores,columns=['model','best_score','best_params'])
data_model_score

                    model  best_score                  best_params
0  DecisionTreeClassifier    0.763248     {'criterion': 'entropy'}
1    KNeighborsClassifier    0.782330           {'n_neighbors': 5}
2                     SVC    0.796849  {'C': 100, 'kernel': 'rbf'}

In [147]:
model_svc = SVC( C= 100,kernel='rbf')

In [148]:
model_svc.fit(x, y)

SVC(C=100)

In [149]:
dt2 = pd.read_csv("C:\\Users\\ashwi\.jupyter\\Jupyter Notebook\\Assignment Titanic\\test.csv")

In [150]:
dt2.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [151]:
dt3 =dt2.drop(['PassengerId','Name','Ticket','Cabin','Embarked','SibSp','Parch'], axis=1 )

In [152]:
dt3.head()

   Pclass     Sex   Age     Fare
0       3    male  34.5   7.8292
1       3  female  47.0   7.0000
2       2    male  62.0   9.6875
3       3    male  27.0   8.6625
4       3  female  22.0  12.2875

In [153]:
dt3.isnull().sum()

Pclass     0
Sex        0
Age       86
Fare       1
dtype: int64

In [154]:
dt3['Age'].fillna(dt3['Age'].mean(),inplace=True)

In [155]:
dt3.head()

   Pclass     Sex   Age     Fare
0       3    male  34.5   7.8292
1       3  female  47.0   7.0000
2       2    male  62.0   9.6875
3       3    male  27.0   8.6625
4       3  female  22.0  12.2875

In [156]:
dt3['Fare'].fillna(dt3['Fare'].mean(),inplace=True)

In [157]:
dt3.head()

   Pclass     Sex   Age     Fare
0       3    male  34.5   7.8292
1       3  female  47.0   7.0000
2       2    male  62.0   9.6875
3       3    male  27.0   8.6625
4       3  female  22.0  12.2875

In [158]:
sex_dummies=pd.get_dummies(dt3['Sex'],drop_first=True)

In [159]:
dt3= pd.concat([dt3,sex_dummies],axis=1)
dt3.drop(['Sex'], axis=1, inplace=True )

In [160]:
dt3.head()

   Pclass   Age     Fare  male
0       3  34.5   7.8292     1
1       3  47.0   7.0000     0
2       2  62.0   9.6875     1
3       3  27.0   8.6625     1
4       3  22.0  12.2875     0

In [161]:
dt3[feature_scale] = ss.fit_transform(dt3[feature_scale])

In [162]:
dt3.head()

   Pclass       Age      Fare  male
0       3  0.334993 -0.498407     1
1       3  1.325530 -0.513274     0
2       2  2.514175 -0.465088     1
3       3 -0.259330 -0.483466     1
4       3 -0.655545 -0.418471     0

In [163]:
dt.head()

   Survived       Age      Fare  male  male
0         0 -0.592481 -0.502445     1     1
1         1  0.638789  0.786845     0     0
2         1 -0.284663 -0.488854     0     0
3         1  0.407926  0.420730     0     0
4         0  0.407926 -0.486337     1     1

In [164]:
dt.size

4455

In [165]:
dt3.size

1672

In [174]:
y_predicted = model_svc.predict(dt3)

In [175]:
submission = pd.DataFrame({
        "PassengerId": dt2['PassengerId'],
        "Survived": y_predicted
    })

In [176]:
submission.to_csv('titanic_submission_v02.csv', index=False)